[
  [
    "You have or should have made progress in your self-development, which can help you achieve your personal goals.",
    "You have or should have achieved something unique, guided by unknown forces or driven by your soul. You have or should have been leading a situation with this energy.",
    "You have or should have received help from a teacher or mentor, or helped as a teacher or mentor yourself.",
    "You have or should have received nourishment and security, a gift or new personal development. This could have come after a storm that has taken away something else.",
    "You have or should have mastered a situation, knowledge or skill.",
    "You have or should have followed or embraced a tradition for a long period of time.",
    "You have or should have chosen to evolve. You have or should have made compromises or embraced your relationship in order to grow.",
    "You have or should have been careful and very sensitive to past danger, or made significant changes in your life, but always with attention and care.",
    "You have or should have received help from family, friends, colleagues or a group of people.",
    "You have or should have taken time away from social environment and embraced a communion to yourself or to nature.",
    "If you were in a lucky period, you enjoyed it while it lasted. If you were in an unlucky period, you are now or soon out of it.",
    "You have faced a situation where you had to care for details and precision. If you did, good outcome will come. If you didn't, bad outcome might come.",
    "You have or might have faced a situation you had no control over. You should have let it pass, learning from it to gain better wisdom. You might need to show humiliation.",
    "A project, plan or relationship has ended or got cancelled. This is not necessarily a bad situation. It can open new opportunities.",
    "You have or should have demonstrated patience and hard work on yourself. The outcome is a great growth or level of skill, and it is imminent",
    "You have or should have liberated passion and desires to experience or achieve a form of freedom.",
    "There was a striking change, a collective action or act of nature that has destabilized the status-quo and made the situation more fair for everyone.",
    "You have or should have been more mindful of the forces of nature, that you can't control everything.",
    "This has been a moment of self-discovery, revealing and accepting yourself. Use this new learning to grow.",
    "You have or should have been protected by unknown forces.",
    "You have or should have opened yourself and revealed your true self. This brought confidence, help from others and higher quality in your actions.",
    "You have or should have been protected by unknown forces, but you have also been part of this energy by a new personal development.",
    "You have or should have been very focused, and this is going to result in your desired goal.",
    "You have or should have been facing some doubt about making a decision, or you have been in opposition to someone. Step back and think, plan, before moving forward.",
    "You have or should have been patient and optimistic about a brighter future. Your efforts will be bringing the rewards soon.",
    "You have or should have started a project with a group of people. Continue on this project towards the vision.",
    "You have struggle in some situations because of too high ambition or competitiveness. Step back and re-assess your ego, or the effect you have on other's ego.",
    "You have succeeded in a team challenge or effort. It is time to celebrate and recognize each other contribution. Be humble and accept the recognition.",
    "You have vainquished a very tough challenge. Don't forget to stay humble and do not assume you are invincible.",
    "You have been part of a project or plan that is moving forward and difficult to control. Time to keep up and to run forwards with it.",
    "You have been doing too much, took too much under your control. You need to accept help, delegate and get some rest.",
    "You have been in a difficult battle or challenge, and you have no option but to succeed. You need to continue the fight until the end.",
    "You have been trying to be independant, no strings attached to any situation. You were enjoying or seeking freedom. This in order to learn and experiment in life.",
    "You have or should have demonstrated a lot of energy, enthousiasm and even strength in fights. Be mindfull that not everyone around can endure it too frequently.",
    "You have or should have been energetic and supportive, helping others in order to succeed. But if someone was not contributing well, you abandonned them without hesitation.",
    "You have been in need for a challenge, for a big task to show your skills and be recognized.",
    "You have received a great source of love and support. You can relax and enjoy it.",
    "You have or should have started or deepened a relationship. This can be with someone else or with yourself.",
    "You have or should have succeeded in a community or social relationship. You have received support and encouragement and you can celebrate the success.",
    "You have been feeling unhappy, unfullfilled or uncomfortable with the current situation.",
    "You have been facing the consequence of a large flow of negative emotions like rage or hate.",
    "You were optimistic and enthousiastic. You should keep this fresh and open mind.",
    "You have or should have been creative and using imagination to achieve your goals.",
    "You have placed trust in someone too easily and suffered the consequences. Let it be a reminder to stay realistic.",
    "You have or should have achieved successfully a significant plan, project or goal. You have been happy about it by itself, not necessarily from the financial outcome it brought.",
    "There has been a happy, family event that brought happiness to several generations. A lot of support came from family.",
    "You have been living in some sort of fantasy for a while and should now make effort to get closer to reality.",
    "You have come back home and expected to be recognized for the effort and achievements you have done.",
    "You have had difficulties to identify your own interests in favor of protecting or helping others. It gave the impression you were overwhelmed.",
    "You have or should have been recognized as a person of great strength, a mentor. People might have been impressed by your past achievements and don't question your force.",
    "You have or should have followed you prime objective and beliefs. This has helped you driving progress and evolution.",
    "There has been conflicts and oppositions, with no parties were willing to communicate and bring harmony.",
    "A separation has happened. It could have been for a greater good as the relationship might not have been working well and freed you.",
    "You have taken a journey to your ancestors and old teachers, meditating on the help and values they brought to you.",
    "You have or should have observed and studied the casualties of a failed plan or project. Study well to bring a new strategy.",
    "You have or should have taken a scientific, rational approach to tackle a situation of face a challenge.",
    "You should have studied more a situation and worked smarter instead of harder.",
    "You have faced a milestone stage, a test where the only outcome was either success or failure.",
    "You have been looking at your fate or challenges in a restrictive win-or-lose situation. You should let go of fear or ego and see the potential for growth in any battle.",
    "There has been closure, the end of a period and there is nothing that can be done to change the outcome. Don't try to.",
    "You have been observing and gathering information, but instead of using it for your superiors, you used it for your own good. Be warned that double agents have a risky life.",
    "You have been single-minded and acting without much thinking. Sometimes it is the right way to make progress, but it shouldn't be the default way.",
    "You have used your intellligence and motivation for a better or even perfect future help raise up people around you. But you can be perceived as rigid, hard to please.",
    "You have or should have listen, observed and thought well before speaking and bring the answer to help everyone.",
    "You have or should have planted a seed, studied in order to obtain a great harvest.",
    "You have or should have used patience and not rushed a decision or action. Regardless of what was apparent, things keep changing and therefore you should have waited to get a clearer picture.",
    "You have or should have spent time to work intensively in order to reach your goals. You would also gain the satisfaction of a hard work success.",
    "You have or should have moved slowly, deliberately. Observing the environment, been sensitive to the change and made adjustments. You shouldn't let the easy way take over and drive to the failure.",
    "You have been seduced, or have seduced, in order to get some gratification. Be mindful that you haven't wasted resources and that your gain is a long term gain.",
    "You have helped, or received help. But this wasn't selfless help and you should be careful of the consequences.",
    "You have or should have worked vigilantly, using the resources and people skills carefully in order to achieve your goal.",
    "You have been absorbed by work and accomplishing your tasks that you are not able to get personal life. This can affect the people that love and care about you.",
    "You have been successful at obtaining a great success or properties that you are able to enjoy it. It is the result of hard work and people should be able to recognize that.",
    "You have received an abundance of resources and should be grateful of it. Make good use of it and share with who deserves it.",
    "You have or should have been studying how things in the world work and grew to become a master. This is the root for a greater plan and better personal life.",
    "You have or should have been looking at the big picture, planning carefully, moving with the flow and adjusting at every moment to achive your goal.",
    "You have or should have shared your knowledge or resources to others that asked for your help or support. You have the right to reward yourself from contributing to others success.",
    "You have or should have been cautious of material gain and possessions that it could affect negatively your life."
  ],
  [
    "You are or should be making progress in your self-development, which can help you achieve your personal goals.",
    "You are or should be achieving something unique, guided by unknown forces or driven by your soul. You are leading a situation with this energy.",
    "You are or should be receiving help from a teacher or mentor, or are helping as a teacher or mentor yourself.",
    "You are or should be receiving nourishment and security, a gift or new personal development. This could come after a storm that is taking away something else.",
    "You are or should be mastering a situation, knowledge or skill.",
    "You have or should have started following or embracing a tradition.",
    "You are or should be evolving. You are making compromises or embracing your relationship in order to grow.",
    "You are or should be being careful and very sensitive to potential danger, or making significant changes in your life, but always with attention and care.",
    "You are receiving help from family, friends, colleagues or a group of people. Embrace and use this help to succeed.",
    "You are or should be taking time away from social environment and embracing a communion to yourself or to nature.",
    "If you are in a lucky period, enjoye it while it last. If you are in an unlucky period, you will be soon out of it.",
    "You are facing a situation where you have to care for details and precision. If you do, good outcome will come. If you don't, bad outcome might come.",
    "You are facing a situation you have no control over. You should let it pass, learning from it to gain better wisdom. You might need to show humiliation.",
    "A project, plan or relationship is ending or is being cancelled. This is not necessarily a bad situation. It can open new opportunities.",
    "You are or should be demonstrating patience and hard work on yourself. Don't give up. The outcome is a great growth or level of skill, and it is imminent",
    "You are or should be liberating passion and desires to experience or achieve a form of freedom.",
    "There is a striking change, a collective action or act of nature that will destabilized the status-quo and make the situation more fair for everyone.",
    "You are being or should be more mindful of the forces of nature, that you can't control everything.",
    "This is a moment of self-discovery, revealing and accepting yourself. Use this new learning to grow.",
    "You are protected by unknown forces.",
    "You are or should be opening yourself and revealing your true self. This brings confidence, help from others and higher quality in your actions.",
    "You are being protected by unknown forces, but you are also part of this energy by a new personal development.",
    "You are or should be very focused, and this is going to result in your desired goal.",
    "You are facing some doubt about making a decision, or you are in opposition to someone. Step back and think, plan, before moving forward.",
    "You are or should be patient and optimistic about a brighter future. Your efforts will be bringing the rewards.",
    "You are starting a project with a group of people. Continue on this project towards the vision.",
    "You are struggling in some situations because of too high ambition or competitiveness. Step back and re-assess your ego, or the effect you have on other's ego.",
    "You are succeeding in a team challenge or effort. It is time to celebrate and recognize each other contribution. Be humble and accept the recognition.",
    "You are winning a very tough challenge. Don't forget to stay humble and do not assume you are invincible.",
    "You are part of a project or plan that is moving forward and difficult to control. Time to keep up and to run forwards with it.",
    "You are doing too much, taking too much under your control. You need to accept or seek help, delegate and get some rest.",
    "You are in a difficult battle or challenge, and you have no option but to succeed. You need to continue the fight until the end.",
    "You are trying to be independant, no strings attached to any situation. You are enjoying or seeking freedom. This in order to learn and experiment in life.",
    "You are unleashing a lot of energy, enthousiasm and even strength in fights. Be mindfull that not everyone around can endure it too frequently.",
    "You are energetic and supportive, helping others in order to succeed. But if someone is not contributing well, you are abondonning them without hesitation.",
    "You are in need for a challenge, for a big task to show your skills and be recognized.",
    "You are receiving a great source of love and support. You can relax and enjoy it.",
    "You are starting or deepening a relationship. This can be with someone else or with yourself.",
    "You are succeeding in a community or social relationship. You are receiving support and encouragement and you can celebrate the success.",
    "You are feeling unhappy, unfullfilled or uncomfortable with the current situation.",
    "You are facing the consequence of a large flow of negative emotions like rage or hate.",
    "You are optimistic and enthousiastic. You should keep this fresh and open mind.",
    "You are being creative and using imagination to achieve your goals.",
    "You are placing trust in someone too easily and suffered the consequences. You need to stay realistic.",
    "You are achieving successfully a significant plan, project or goal. You are happy about it by itself, not necessarily from the financial outcome it brought.",
    "There is a happy, family event that brings happiness to several generations. A lot of support is coming from family.",
    "You are living in some sort of fantasy and you should make effort to get closer to reality.",
    "You are coming back home, expecting to be recognized for the effort and achievements you have done.",
    "You have difficulties to identify your own interests in favor of protecting or helping others. It gives the impression you are overwhelmed.",
    "You are recognized as a person of great strength, a mentor. People are impressed by your past achievements and don't question your force.",
    "You are or should be following you prime objective and beliefs. This is helping you driving progress and evolution.",
    "There are conflicts and oppositions, with no parties is willing to communicate and bring harmony.",
    "A separation is happening. It could be for a greater good as the relationship might have been working well and freed you.",
    "You are taking a journey to your ancestors and old teachers, meditating on the help and values they brought to you.",
    "You are or should be observing and studing the casualties of a failed plan or project. Study well to bring a new strategy.",
    "You are or should be taking a scientific, rational approach to tackle a situation of face a challenge.",
    "You should study more a situation and work smarter instead of harder.",
    "You are facing a milestone stage, a test where the only outcome was either success or failure.",
    "You are looking at your fate or challenges in a restrictive win-or-lose situation. You should let go of fear or ego and see the potential for growth in any battle.",
    "A closure is happening, the end of a period and there is nothing that can be done to change the outcome. Don't try to.",
    "You are observing and gathering information, but instead of using it for your superiors, you are using it for your own good. Be warned that double agents have a risky life.",
    "You are single-minded and acting without much thinking. Sometimes it is the right way to make progress, but it shouldn't be the default way.",
    "You are using your intellligence and motivation for a better or even perfect future help raise up people around you. But you can be perceived as rigid, hard to please.",
    "You are or should be listening, observing and thinking well before speaking and bring the answer to help everyone.",
    "You are or should be plant a seed, studied in order to obtain a great harvest.",
    "You are or should be patient and not rush a decision or action. Regardless of what was apparent, things keep changing and therefore you should wait to get a clearer picture.",
    "You are or should be spending time to work intensively in order to reach your goals. You will gain the satisfaction of a hard work success.",
    "You are or should be moving slowly, deliberately. Observing the environment, being sensitive to the change and made adjustments. You shouldn't let the easy way take over and drive to the failure.",
    "You are being seduced, or are seducing, in order to get some gratification. Be mindful that you aren't wasting resources and that your gain is a long term gain.",
    "You are helping, or receiving help. But this wasn't selfless help and you should be careful of the consequences.",
    "You are or should be working vigilantly, using the resources and people skills carefully in order to achieve your goal.",
    "You are absorbed by work and accomplishing your tasks that you are not able to get personal life. This can affect the people that love and care about you.",
    "You are successful at obtaining a great success or properties that you are able to enjoy it. It is the result of hard work and people should be able to recognize that.",
    "You are receiving an abundance of resources and should be grateful of it. Make good use of it and share with who deserves it.",
    "You are or should be studying how things in the world work and grow to become a master. This is the root for a greater plan and better personal life.",
    "You are or should be looking at the big picture, planning carefully, moving with the flow and adjusting at every moment to achive your goal.",
    "You are or should be sharing your knowledge or resources to others that asked for your help or support. You have the right to reward yourself from contributing to others success.",
    "You are or should be cautious of material gain and possessions that it could affect negatively your life."
  ],
  [
    "You will make progress in your self-development, which can help you achieve your personal goals.",
    "You will achieve something unique, guided by unknown forces or driven by your soul. You will be leading a situation with this energy.",
    "You will receive help from a teacher or mentor, or will help as a teacher or mentor yourself.",
    "You will receive nourishment and security, a gift or new personal development. This could come after a storm that will take away something else.",
    "You will soon master a situation, knowledge or skill.",
    "You will follow or embrace a tradition, and will so for a long period of time.",
    "You will chose to evolve. You will make compromises or embrace your relationship in order to grow.",
    "You will be careful and very sensitive to potential danger, or will make significant changes in your life, but always with attention and care.",
    "You will receive help from family, friends, colleagues or a group of people. Embrace and use this help to succeed.",
    "You will take time away from social environment and embrace a communion to yourself or to nature.",
    "You will be in a lucky period, enjoy it while it last. You will also face an unlucky period, just wait and it will pass.",
    "You will face a situation where you have to care for details and precision. If you do, good outcome will come. If you don't, bad outcome might come.",
    "You will face a situation you have no control over. You should let it pass, learning from it to gain better wisdom. You might need to show humiliation.",
    "A project, plan or relationship will be ended or cancelled. This is not necessarily a bad situation. It can open new opportunities.",
    "You will need to demonstrat patience and hard work on yourself. The outcome will be a great growth or level of skill. Don't give up on it.",
    "You will liberate passion and desires to experience or achieve a form of freedom.",
    "There will be a striking change, a collective action or act of nature that will destabilized the status-quo and make the situation more fair for everyone.",
    "You will be more mindful of the forces of nature, that you can't control everything.",
    "You will enter a moment of self-discovery, revealing and accepting yourself. Use this new learning to grow.",
    "You will be protected by unknown forces.",
    "You will open yourself and reveal your true self. This will bring confidence, help from others and higher quality in your actions.",
    "You will be protected by unknown forces, but you will also be part of this energy by a new personal development.",
    "You will be very focused, and this will result in your desired goal.",
    "You will be facing some doubt about making a decision, or you will be in opposition to someone. Step back and think, plan, before moving forward.",
    "You will be patient and optimistic about a brighter future. Your efforts will eventually be bringing the rewards.",
    "You will start a project with a group of people. Continue on this project towards the vision.",
    "You will struggle in some situations because of too high ambition or competitiveness. Step back and re-assess your ego, or the effect you have on other's ego.",
    "You will succeed in a team challenge or effort. Don't forget to celebrate and recognize each other contribution. Be humble and accept the recognition.",
    "You will vainquish a very tough challenge. Don't forget to stay humble afterwards, and do not assume you are invincible.",
    "You will be part of a project or plan that is moving forward and difficult to control. Keep up and to run forwards with it.",
    "You are going to do too much, to take too much under your control. You will need to accept or seek help, delegate and get some rest.",
    "You will be facing a difficult battle or challenge, and you have no option but to succeed. You need to continue the fight until the end.",
    "You will try to be independant, no strings attached to any situation. You will seek freedom. This in order to learn and experiment in life.",
    "You will demonstrate a lot of energy, enthousiasm and even strength in fights. Be mindfull that not everyone around can endure it too frequently.",
    "You will be energetic and supportive, helping others in order to succeed. But if someone is not contributing well, you will abandon them without hesitation.",
    "You will be in need for a challenge, for a big task to show your skills and be recognized.",
    "You will receive a great source of love and support. You can relax and enjoy it.",
    "You will start or deepen a relationship. This can be with someone else or with yourself.",
    "You will succeed in a community or social relationship. You will receive support and encouragement and you can celebrate the success.",
    "You will be feeling unhappy, unfullfilled or uncomfortable with the current situation.",
    "You will be facing the consequence of a large flow of negative emotions like rage or hate.",
    "You will be more optimistic and enthousiastic. You should keep this fresh and open mind.",
    "You will be creative and using imagination to achieve your goals.",
    "You will place trust in someone too easily and will suffer the consequences. Keep an eye on being realistic.",
    "You will achieve successfully a significant plan, project or goal. You will be happy about it by itself, not necessarily from the financial outcome it brought.",
    "There will be a happy, family event that will bring happiness to several generations. A lot of support will come from family.",
    "You will be living in some sort of fantasy for a while and should make effort to get closer to reality.",
    "You will go back home and expect to be recognized for the effort and achievements you have done.",
    "You will have difficulties to identify your own interests in favor of protecting or helping others. It will give the impression you are overwhelmed.",
    "You will be recognized as a person of great strength, a mentor. People will be impressed by your past achievements and will not question your force.",
    "You will follow you prime objective and beliefs. This will help you driving progress and evolution.",
    "There will be conflicts and oppositions, with no parties will be willing to communicate and bring harmony.",
    "A separation is coming. It could be for a greater good as the relationship might not have been working well and freed you.",
    "You will take a journey to your ancestors and old teachers, meditating on the help and values they brought to you.",
    "You will have to observe and study the casualties of a failed plan or project. Study well to bring a new strategy.",
    "You will have to take a scientific, rational approach to tackle a situation of face a challenge.",
    "You will have to study more a situation and work smarter instead of harder.",
    "You will face a milestone stage, a test where the only outcome was either success or failure.",
    "You will be looking at your fate or challenges in a restrictive win-or-lose situation. You should let go of fear or ego and see the potential for growth in any battle.",
    "There will be closure, the end of a period and there is nothing that can be done to change the outcome. Don't try to.",
    "You are going to observe and gather information, but instead of using it for your superiors, you will use it for your own good. Be warned that double agents have a risky life.",
    "You will be single-minded and acting without much thinking. Sometimes it is the right way to make progress, but it shouldn't be the default way.",
    "You will use your intellligence and motivation for a better or even perfect future help raise up people around you. But you can be perceived as rigid, hard to please.",
    "You will need to listen, observe and think well before speaking and bring the answer to help everyone.",
    "You will or should plant a seed, study in order to obtain a great harvest.",
    "You will need patience and not rushing a decision or action. Regardless of what was apparent, things keep changing and therefore you should wait to get a clearer picture.",
    "You will have to spend time to work intensively in order to reach your goals. You will gain the satisfaction of a hard work success.",
    "You will have to move slowly, deliberately. Observing the environment, being sensitive to the change and made adjustments. You shouldn't let the easy way take over and drive to the failure.",
    "You will be seduced, or will seduce, in order to get some gratification. Be mindful that you don't waste resources and that your gain is a long term gain.",
    "You will give help, or wioll receive it. But this won't be selfless help and you should be careful of the consequences.",
    "You will have to work vigilantly, using the resources and people skills carefully in order to achieve your goal.",
    "You will be absorbed by work and accomplishing your tasks that you are not able to get personal life. This can affect the people that love and care about you.",
    "You will be successful at obtaining a great success or properties that you are able to enjoy it. It is the result of hard work and people should be able to recognize that.",
    "You will receive an abundance of resources and should be grateful of it. Make good use of it and share with who deserves it.",
    "You will have to study how things in the world work and grew to become a master. This is the root for a greater plan and better personal life.",
    "You will have to look at the big picture, planning carefully, moving with the flow and adjusting at every moment to achive your goal.",
    "You will be asked for your knowledge or resources, you should give it. You have the right to reward yourself from contributing to others success.",
    "You will have to be cautious of material gain and possessions that it could affect negatively your life."
  ],
  [
    "You need to let yourself open to spontaneity. Stop questioning everything and let things happen.",
    "You need to trust your intuition, to get more clarity and freshness in the situation. This will help you see through",
    "You need to consider your inner-self and beliefs, otherwise you could be exhausted and unhappy.",
    "You can trust your good sense and care to improve a situation, support people around you and help them grow.",
    "You can trust your experience and mastery to assert a situation. You can act with confidence.",
    "You should start or continue learning in the area you have chosen or are involved with.",
    "You should make some compromises, in order to plan for the future. Then follow your convictions.",
    "New challenges or people are coming to your life, and you will need to be careful, attentioned and focused to benefit from it.",
    "You should discipline yourself to grow or succeed in a situation, and should ask others to do the same.",
    "You should take some time to reflect and assess a situation. Let people know you need this time to be able to resolve the current challenge.",
    "Changes are coming, some good and some bad. You are also receiving support in these changes. Take advantage of the changes for long term benefits.",
    "You should listen carefully your surrounding. Subtle words or expressions might reveal a new truth or clarification. Don't act upon it though, just listen to get wiser.",
    "You need to accept that you can't control everything. Sometimes things happen, good or bad. Let it go.",
    "You should detach yourself from traditions or from the past. It is a moment to move forward, while respectful to others.",
    "Prepare yourself to spend more time on your own spiritual, emotional or intellectual life.",
    "You need to express your true emotions, even if they are negative emotions. Don't act upon them all, but don't hide it from others so they are aware of your situation.",
    "You are in the middle, or even leading important changes. Be aware that you can't control everything and don't resist everything. Be humble and take the offered help if it comes.",
    "You need to communicate with your inner soul, listen to the voice within and follow their advises. However, keep an ethical behaviour.",
    "You can trust and believe in your instints or intuitions. Listen to you inner self and use it to learn new knowledge about yourself. Don't use it to act. Simply listen and absorb.",
    "Own your true self and have the confidence to show it. This will take away from others the power they have over you.",
    "Invest your energy in new growth. For yourself, but without ignoring people around you. Trust your intuitions and use it to transform yourself for greater good.",
    "It is a great time to take risk and try big changes. You will be protected, even if you do mistakes, the effects won't be damaging.",
    "You should start very soon to take action for a significant change. So you should also get prepared.",
    "You should trust your decision making process. Review new information or knowledge and improve your decision with it.",
    "You have been waiting for a sign, this is it. You can now take this action or opportunity you've been waiting for. The time is favorable for success.",
    "If you want to bring more people in your plans or project, your current charisma and creativity will help you inspire people.",
    "You are encouraged to find your passion, your ambition. The enrgies around will support you.",
    "Follow your ideals and convictions, even if that affects some people. If you truely believe in something, then act and defend it.",
    "You are at the right moment for your best results. You can outperform everyone. So it's time to take action.",
    "Learn from recent success and use it to succeed again. You should feel confident you have what it takes to accomplish your goals.",
    "You have done all you could to achieve the best outcome of a situation. You don't need to prove anything to anyone.",
    "You need to remember the innocence and beliefs of your childhood, and see that whatever obstacle comes, there is good in the future.",
    "You are in position to observe, silently study and learn your surrounding. Don't try to take action at this time.",
    "You should not relax on your past success and stop taking action. In contrary, you have the energy and skills, you should use it to continue growing.",
    "You should keep your place in the current situation and not try to do more than expected. Trust in the future and in yourself to do what was asked from you.",
    "You are in a position where you have the chance to demonstrate your skills or experience. Take it humbly and without doubting in yourself.",
    "Look at the good things and people around you, observe the positive. Enjoy the spiritual quality of the present.",
    "You might need to start talking what you have in your heart. The other could be also waiting to do the same. Now is a good time to share more of your inner self.",
    "Now is a good time to reach out to your family and get their talent, ideas and support to hlep you achieve your goals.",
    "You need to consider what is blocking or slowing you down. You can do more than what it looks, and it is time to take action and get out of the unhappiness.",
    "Don't overestimate yourself and overcommit. Don't be too negative about a loss. Look at what is still here or what opportunities are presenting.",
    "Look back at your past and identify repeated pattern. Filter out the event or moments you don't want to repeat and act in order to achieve it.",
    "You should relax and take time to dream of a brighter future. Try to find positive thought to let go of your fears.",
    "You might be holding an old pain, fear or trauma, and not letting it go is somehow blocking you from flourishing. You should try to put them to rest.",
    "You should recognize the current moment is supporting your desire. Don't resist or judge, but let yourself carried by this wave.",
    "Follow your family or team and everyone should help each other. General contribution of everyone for a greater and long lasting good outcome.",
    "Try and find how you could provide more support, be of more service. Then act upon it, help your neighbor to the best of your abilities.",
    "A new opportunity is presenting itself and you should cease it with both hands. All your past achievements led you here.",
    "You are being generous, helping and supportive. Don't give too much or more than needed so you don't get stepped over.",
    "You need to join the community, group or family and show your integrity and abilities to serve the greater good. This will inspire others to join and achieve success.",
    "You can concentrate on your current actions, this will lead you to your objective. This is a very supporting moment so don't hesitate.",
    "This is a time you need to be patient and not rush a decision. There are opposing opinions or ideas that you could take advantage of listening to first.",
    "You will need to become more independent in your choices and actions. Be more resilient and surround you with people that lift you up rather then bring you down.",
    "You should not share your ideas or start new project in the current environment. Observe and mature your ideas till the right moment comes.",
    "People around you are being egotistic and selfish. You need to prepare yourself to be strong, but not taking advantage or fighting against them.",
    "You have observed, created a plan or strategy. Now it is time to act, fast. People will appreciate your clear mind to make progress.",
    "You have clarity in what needs to be done. Even if things changes, keep focusing on the goal and you will reach it. Additionally it will increase your self-confidence.",
    "You are in good position to make progress. Either by learning from mistakes and obstacles, or by succeeding in your challenges.",
    "This is a form of warning that you have lowered you way of life or expectations in order to protect yourself. Use your time and energy for a constructive outcome rather than a protective one.",
    "You need to lay low and protect yourself. It is the best way, being patient, until the situation gets better.",
    "This is a time to be vigilent, quiet and paying attention to every details.",
    "You are open to conflicting ideas, to people bring different vues to your own beliefs. If you listen and extract the best out of all ideas, you will achieve great success.",
    "You need to be more independent and not rely only on others in order to achive your goals.",
    "You need to spend some time to analyse and review the current beliefs and assumptions. Find the truth and shed light to it.",
    "You should work gradually towards your goal. Step by step and every days until you complete your goal.",
    "Have a little patience and look for all facts before making a decision",
    "This is a good time to shine. Demonstrate and show your skills and unique abilities. This will lead to being offered new offers. Be humble in accepting recognition.",
    "Be prudent of what you have gain via an external event. The life of the people that have worked hard to build this gain might still depend on the way you use it, or waste it.",
    "It is time to enter into mutual agreement and maybe sign upon it. Use each others commitment to help achieve the greater goals.",
    "You are trying to help people and give your time and energy to them. Be mindful to not ask much in return and keep your focus on the others.",
    "Don't rush or try to skip steps. Patience and perseverance will not only bring you closer to your goal, but you will also grow on the journey to achieving it.",
    "You are very focused on your work, and providing hard work to accomplish your goal. Be mindful to not sacrifice quality by working too hard.",
    "Opportunities are coming you ways. But you need to be prepared, observing and taking care of bringing the best out of it.",
    "You realize you can be a source of resource, knowledge or skills for others. Think about how you can utilize your talent to help others.",
    "You should learn the topin you want to master in and out. Do not leave any stone untouched. Absorb everything in order to become a master.",
    "Your recognized skills and knowledge will be seeken. Your role will be a main factor in obtaining the best possible outcome from the project.",
    "You are protected and should not worry about your surrounding. Be confident and take advantage of this safety to achieve greater good.",
    "You should act as if the success was inevitable. Focus on the goals and have the confidence in your actions. You will at the same time motivate others which will increase the chances of success."
  ],
  [
    "Be mindful your emotions might be holding you back.",
    "You are uncomfortable or unsure in this situation. Courage, conviction and truth will help you.",
    "Do not forget there are others that can help or contribute too. Balance your inner-self with the outside world.",
    "If you are in a position of power and decision making, be mindful to not go to the extreme in your actions or decisions.",
    "Don't forget to be humble. With great power comes great responsibilities.",
    "Be mindful not to rebel against tradition without reasoning.",
    "You might be resisting or opposing unfairly. Make sure you are considering the others in your decisions or actions.",
    "You might need to push yourself, recognize your resistance and face bravely your future.",
    "You don't have control over the situation and should let the others take care of it.",
    "You might be afraid of something, or unsure about your abilities. Slow down, relax and assess the situation in order to succeed.",
    "If you have dropped from the heights, or hit bottom, this is an opportunity to rethink and start over. Maybe scoping more modestly the expectations.",
    "You might not understand why a situation is getting out of hand or appears out of control. Sit it up, let time do its work.",
    "Don't sacrifice yourself as it will not result is the expected outcome.",
    "Be patient, don't despair. There isn't only bad outcome. This might allow you to start something new.",
    "Don't give up on yourself. You need to pick yourself up and pursuit your needs, take care of yourself.",
    "You need to control yourself and not let passions, impulses and desires will get you into troubles.",
    "Important changes or even striking events have occured and are over. Leave them in the past and look towards the future with the knowledge of what has happened.",
    "You might feel useless, unskilled or unfit for the situation. Don't despair and learn what you need to overcome the situation.",
    "You might be over-confident, or even desillutional about yourself. Decrease your ego or emotion and be more truthful to yourself.",
    "You will have positive impact on people. Take this time to help arround you or beyond.",
    "You have opened yourself to others, but are still facing some challenges or wall. Step back and find a new way to navigate.",
    "Although everything is moving forward and positively, there might be a slowdown. Trust and surf this wave.",
    "You might be resisting a big change. Even if it seems risky, don't be afraid of what's coming.",
    "Don't be blocked by doubt or hesitation. You will be able to make the right choice if you relax and calm down.",
    "You need to take some rest and recharge your optimism. You might be exhausted and need to recover.",
    "In order to succeed in a project or new situation, you need to seek advice from creative people.",
    "You are in a difficult position where opposition and competition is stronger. You might consider this a sign to move towards a different direction.",
    "You are going to be given a tough challenge. You need to adjust your expectations and stay tuned with the reality of the situation.",
    "You are able to accomplish great things, but you are letting your lack of motivation taking over. Don't let yourself down and step up.",
    "You might need to wake up and realise not everything is fine the way it is. You need to take control back over your life.",
    "You might be resiting an inevitable outcome. Don't try to fight, especially if you are not fully certain you are in the right.",
    "You might need to step back and look at the big picture out of a situation. Review your plan, break it down to stages.",
    "You need to revise your ego and let go. Don't overthink of your reputation or image. Contribute and be humble about it.",
    "You might have a strong desire for change and the energy to realise it. But be aware of people around and take them into consideration before acting.",
    "If you have a secret agenda or hidden intentions, don't be fooled that people around you are not aware of it.",
    "You have some level of power and decision making, but don't try to overdue or take more than you should.",
    "You should slow down, stop overthinking about yourself or doubting about yourself. Cleanse yourself before making any new decision or taking action.",
    "You are investing too much energy or time in a relationship. Don't forget your own happiness if you want the relationship to succeed.",
    "You need to let in the love and efforts of others to reach into you. Open your arms and heart and enjoy the harmony.",
    "You need to recognize you might be part of your own unhappiness or discomfort. Look back at yourself and learn from what you see.",
    "A fear or bad situation will turn out to be the start of a better outcome. Face the challenge and construct your freedom.",
    "You have finally come to a closure with some of the past events in your life. They have no more control over your life.",
    "Find something to trigger your happiness again. You have stopped dreaming, it is time to start again.",
    "You might have faced a tragic or difficult event. But you have faced it with strength and you should use this positivity to increase the confidence in yourself.",
    "You have achieved a goal you had set for yourself, but it didn't bring the result you expected. You need to review how you set your goals so they bring what you really want.",
    "Family or community is or will be damaged by personal judgement or ego. Someone needs to step in and try to stir the group out of the storm.",
    "You have been taking for granted the tolerance of people around you regarding your own fantasies. You should consider their well-being and need with higher priority.",
    "You are making excuses or blaming others instead of trying to be part of the solution. You have skills that you could use to resolve conflicts or improve situations. You shoudl use them.",
    "Be honest with yourself and others. Recognize you own pain or unhappiness and find strategies to get pass it.",
    "Although you have great strength and power, you are holding forgiveness and blessing to others that don't have your skills. Let the sunshine come and lighten the space.",
    "You are not allowing yourself to see the one thing that matters the most in your life. Reexamine your decisions in order to increase the chances to reach your goals.",
    "Instead of thinking you have all the answers, listen to the other side too. It will bring new perspective and create a great outcome.",
    "A new, clearer environment is coming. Ego, feelings and emotions are no longer going to drive the discussions but good communication is.",
    "Even if you prefer a solitary type of life, make sure you seek help and energy of supporting people to improve your life.",
    "You have gained new skills, mastery or knowledge that shows how much you have grown. You are using your own skills to succeed instead of taking advantage of others weaknesses.",
    "You haven't taken a scientific, rational approach to face a challenge and therefore limiting your options. Try to review your emotions or biases to re-align with your goals.",
    "If you have given your best and haven't succeeded, don't beat yourself. You have honorably fullfilled your responsibilities.",
    "This is the time to estimate and possibly judge a situation. Don't judge others in any different way you would judge yourself. Don't blame in order to save yourself.",
    "You are going to see the light at the end of the tunnel, the end of a dark period.",
    "Instead of seeing the difficulties and making excuses, try to see the positive outcome that can be realized.",
    "Be mindful to not diminish the others when communicating. Your message will lose its worth, and you will appear less trustable.",
    "You are escaping conflict, finding excuses to get out of a challenge, even promising something you can't provide. Learn to be humble and truthful and you might receive the help you need.",
    "You need to show more compassion for yourself. Listen to your heart and serve your own feelings and needs as well as those of others.",
    "You might have been serving your own good too much and not your surrounding. Raise yourself and go help your peers or family.",
    "You need to search your heart and find your motives in order to achieve your goals.",
    "You should refocus on your priorities and actions. Procrastinating or trying to do too many things at the same time will bring no good outcome.",
    "You might seek perfection or exclusive ownership. Let go of your ego and allow for tasks that are complete but lacking your expectations of perfect.",
    "You should not worry about your self comfort and personal gain. Instead, see how you can help selflessly.",
    "You should look at the current situation and check that you are not being deceived, or that you are not deceiving others.",
    "You should not be focused on the payback from your actions or generosity. No one would believe your acts of generosity is you ask too much in return.",
    "You are working towards a result, but not looking carefully in the way to reach it. Be careful not to gamble or take unnecessary risks. You might lose more than you can win.",
    "You are in danger to lose yourself to your work. You need to distinguish work from personal life.",
    "You need self discipline and rest to regain energy and focus. It will lead to healthier and happier life.",
    "You might need to start over from a new ground. It can be seen as well as a terrible outcome or an opportunity to renew yourself.",
    "You need to accept being a servant and learning from your superiors in order to grow your talent and become a master.",
    "You need to stop wasting your energy and resources in places that don't appreciate you or don't have your convictions.",
    "You need to look back at yourself and identify if you have let yourself addicted to pleasure or lust that prevent you from growing or could lead to falling in a deep hole.",
    "You need some self-discipline and take distance from physical or material possessions.There is more to life than controlling others and ownership of possessions."
  ]
]
